#Задача 1

a = int(input('введите цифру, обознчающую день недели: '))
print('Это выходной день?') 
if(a>=1) and (a<=5):
    print('нет')
else:
    print('да')
