#Задача 4

a = int(input('Укажите номер четверти: '))
if a==1:
    print('x от нуля до + бесконечности, y от нуля до + бесконечности')
if a==2:
    print('x от нуля до - бесконечности, y от нуля до + бесконечности')
if a==3:
    print('x от нуля до - бесконечности, y от нуля до - бесконечности')
if a==4:
    print('x от нуля до + бесконечности, y от нуля до - бесконечности')
