# Задача 5

x1 = int(input('Введите координату x1: '))
y1 = int(input('Введите координату y1: '))

x2 = int(input('Введите координату x2: '))
y2 = int(input('Введите координату y2: '))

a=((x2-x1)*(x2-x1)+(y2-y1)*(y2-y1))**(0.5)
print(a)